{
  "priority": 5,
  "description": "Stories must deliver independent value as complete functional accomplishments. Balance value with testability - stories should be valuable enough to matter but small enough to deliver quickly. Not just data access or isolated operations.",
  "do": {
    "description": "Create stories that deliver independent value. Example: 'User --> loads story graph' (value: see story structure)",
    "guidance": [
      {
        "description": "Stories must deliver measurable value independently (INVEST principle) as complete functional accomplishments - order by user journey flow, not technical sequence. Keep valuable enough to matter but small enough to test and deliver. Accomplish something meaningful with clear business/user benefit and complete flow: start → process → outcome.",
        "example": ["User --> loads story graph (value: see story structure)", "Developer --> edits epic name (value: update story map)", "User --> generates DrawIO diagram (value: visual diagram output)", "System --> initializes configuration on startup (value: system ready to use)"]
      }
    ]
  },
  "dont": {
    "description": "Don't create stories without independent value or complete outcomes. Example: 'System --> reads all epics from diagram' (no value - what happens with the data?)",
    "guidance": [
      {
        "description": "Don't create data access operations without purpose or value - these lack independent value and complete outcomes",
        "example": ["System --> reads all epics from diagram (no value - what happens with data?)", "System --> loads all features in graph epic (no outcome or benefit)", "System --> serializes components to JSON (no user value)", "System --> converts diagram to StoryGraph format (no benefit)", "System --> calculates component positions (no accomplishment)"]
      },
      {
        "description": "Don't create stories too large to deliver - maintain testability by splitting large workflows into smaller valuable stories",
        "example": ["User --> manages entire order lifecycle (too large, many flows - split)", "System --> processes complete checkout workflow (too large, multiple flows - split)"]
      },
      {
        "description": "Don't order stories by technical sequence instead of user journey flow - stories should follow the user's journey, not implementation order"
      },
      {
        "description": "No value indicators to reject - these patterns indicate stories lack independent value",
        "example": ["Just reads/loads data without outcome", "Just converts/formats data without purpose", "Just calculates/computes without result"]
      }
    ]
  }
}
