{
  "priority": 6,
  "description": "Use properties where resource-oriented access makes more sense than explicit operations. Properties hide calculation timing. Explicit operations when action is meaningful. Example: Get total value: Money (property); Submits for fulfillment: FulfillmentRequest (operation).",
  "scanners": [
    "agile_bot.bots.base_bot.src.scanners.calculation_timing_scanner.CalculationTimingScanner"
  ],
  "do": {
    "description": "Use properties for resource access, explicit operations when action is meaningful. Example: Get total value: Money (property); Submits for fulfillment: FulfillmentRequest (operation)",
    "guidance": [
      {
        "description": "Use properties when accessing resource state - hides whether value is computed, cached, or stored",
        "example": [
          "Portfolio",
          "    Get total value: Money, Holding, MarketPrice (property - could be computed or cached)",
          "    Get risk score: RiskScore, RiskModel (property - timing hidden)",
          "    Get holdings: Holding (property - simple access)",
          "",
          "Order",
          "    Get subtotal: Money, LineItem (property - hides calculation)",
          "    Get line items: LineItem (property - simple access)",
          "",
          "(Properties hide when/how values are determined)"
        ]
      },
      {
        "description": "Use explicit operations when the action itself is meaningful or has side effects",
        "example": [
          "Portfolio",
          "    Rebalances to target allocation: Trade, TargetAllocation (operation - action is meaningful)",
          "    Executes trades: ExecutionResult, Trade, Broker (operation - side effects)",
          "",
          "Order",
          "    Submits for fulfillment: FulfillmentRequest (operation - action is meaningful)",
          "    Validates inventory: Boolean, InventoryService (operation - explicit check)",
          "",
          "(Operations when the action matters, not just the result)"
        ]
      },
      {
        "description": "Choose based on whether caller cares about the action or just the value",
        "example": [
          "Trade",
          "    Get execution price: Money (property - caller just wants the value)",
          "    Executes through broker: ExecutionResult, Broker (operation - action matters)",
          "",
          "Payment",
          "    Get authorization code: AuthorizationCode (property - just wants value)",
          "    Authorizes with gateway: AuthorizationResult, PaymentGateway (operation - action matters)",
          "",
          "(Property when value is the goal, operation when action is the goal)"
        ]
      }
    ]
  },
  "dont": {
    "description": "Don't expose timing details or use operations where properties make more sense. Example: Get cached total (wrong - reveals timing) vs Get total (right); Compute total (wrong) vs Get total (right)",
    "guidance": [
      {
        "description": "Don't expose calculation timing in property names",
        "example": [
          "Portfolio",
          "    Get cached total value: Money (WRONG: reveals caching)",
          "    Get pre-computed risk score: RiskScore (WRONG: reveals timing)",
          "    Get on-demand metrics: Metrics (WRONG: reveals timing)",
          "",
          "(Should be: Get total value, Get risk score, Get metrics - hide timing)"
        ]
      },
      {
        "description": "Don't use operations when caller just wants a value with no side effects",
        "example": [
          "Portfolio",
          "    Compute total value: Money (WRONG: operation for simple value access)",
          "    Derive risk score: RiskScore (WRONG: operation for simple value access)",
          "",
          "Order",
          "    Calculate subtotal: Money (WRONG: operation for simple value access)",
          "",
          "(Should be: Get total value, Get risk score, Get subtotal - properties for value access)"
        ]
      },
      {
        "description": "Don't hide meaningful actions behind property access",
        "example": [
          "Order",
          "    Get fulfillment: FulfillmentRequest (WRONG: hides that submission occurs)",
          "",
          "Payment",
          "    Get authorization: AuthorizationResult, PaymentGateway (WRONG: hides gateway call)",
          "",
          "(Should be: Submits for fulfillment, Authorizes with gateway - make action explicit)"
        ]
      }
    ]
  }
}
